/*- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число*/
/*(в першу, другу, третю или четверту частину години).*/
//_______________________________________________________________________________
        // let time=prompt('Введіть число від 0 до 59');
        // if (time>=0 && time<15){
        //     console.log('перша чверть')
        // } else if (time>=15 && time<30){
        //     console.log('друга чверть')
        // }else if (time>=30 && time<45){
        //     console.log('третя чверть')
        // }else if (time>=45 && time<60){
        //     console.log('четверта чветь')
        // }else{
        //     console.log('неправильно введені дані')
        // }

/*- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).*/
//___________________________________________________________________________________________________________________________________________________
        // let day=prompt('Введіть число від 0 до 59');
        // if (day>=1 && day<=11){
        //     console.log('first')
        // } else if (day>11 && day<=21){
        //     console.log('second')
        // } else if (day>21 && day<=31){
        //     console.log('third')
        // }else{
        //     console.log('error')
        // }
/*- У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.*/
//_____________________________________________________________________________________________________________________________________________________
        //test = confirm('Якщо неправильно натисніть ок')
        // if (test!==true){
        //     console.log('Вірно')
        // }else {
        //     console.log('Неправильно')
        // }
/* Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)*/
        // let result = test === true ? 'Неправильно':'Вірно';
        // console.log(result)

/*- Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3*/
    // let a=[1,0,-3];
    //
    // if (a[0] === 0) {
    //     console.log('Вірно')
    // } else {
    //     console.log('Невірно')
    // }
    //
    // if (a[1] === 0) {
    //     console.log('Вірно')
    // } else {
    //     console.log('Невірно')
    // }
    //
    // if (a[2] === 0) {
    //     console.log('Вірно')
    // } else {
    //     console.log('Невірно')
    // }


/*- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.*/

    // let day =prompt('Введіть номер тижня')
    // switch (day){
    //     case '1':
    //         console.log('В понеділок: лекція на 20:00');
    //         break;
    //     case '2':
    //         console.log('В вівторок: практика');
    //         break;
    //     case '3':
    //         console.log('В середу: лекція на 20:00');
    //         break;
    //     case '4':
    //         console.log('В четвер: практика');
    //         break;
    //     case '5':
    //         console.log('В пятницю: лекція на 20:00');
    //         break;
    //     case '6':
    //         console.log('В суботу: англійська');
    //         break;
    //     case '7':
    //         console.log('В неділю: спимооооо і гуляємо');
    //         break;
    // }

/*- Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.*/

    // let year = prompt('Введіть рік');
    // result = year%4===0 ? 'Високосний':'Звичайний рік';
    // console.log(result);

/*- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“*/
/*Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!*/
    // let jsName=prompt('Яка «офіційна» назва JavaScript?')
    // if (jsName==='ECMAScript'){
    //     console.log('Правильно!')
    // }else{
    //     console.log('Не знаєте? ECMAScript!')
    // }